In [1]:
import pandas as pd

In [2]:
# DataFrame -> Tabular representation of the data
l=[100,200,300,400]
df=pd.DataFrame(l)

In [3]:
df

     0
0  100
1  200
2  300
3  400

In [4]:
t=('Asia','Austrelia','America','Aferica')
dft=pd.DataFrame(t)

In [5]:
dft

           0
0       Asia
1  Austrelia
2    America
3    Aferica

In [13]:
di={'Name':['Google','Yahoo','Facebook','Youtube'],
   'Rev':[1000,2000,3000,4000],
    'Cnt':['India','USA','France','Germany'],
    'Intr':[200,300,400,500]
   }

In [11]:
di

{'Name': ['Google', 'Yahoo', 'Facebook', 'Youtube'],
 'Rev': [1000, 2000, 3000, 4000],
 'Cnt': ['India', 'USA', 'France', 'Germany'],
 'Intr': [200, 300, 400]}

In [14]:
dfd=pd.DataFrame(di)

In [15]:
dfd

       Name   Rev      Cnt  Intr
0    Google  1000    India   200
1     Yahoo  2000      USA   300
2  Facebook  3000   France   400
3   Youtube  4000  Germany   500

In [16]:
# Viewing Data
dfd['Name']

0      Google
1       Yahoo
2    Facebook
3     Youtube
Name: Name, dtype: object

In [17]:
dfd['Rev']

0    1000
1    2000
2    3000
3    4000
Name: Rev, dtype: int64

In [18]:
dfd.Name

0      Google
1       Yahoo
2    Facebook
3     Youtube
Name: Name, dtype: object

In [19]:
dfd['Name','Rev']

KeyError: ('Name', 'Rev')

In [20]:
dfd[['Name','Rev']]

       Name   Rev
0    Google  1000
1     Yahoo  2000
2  Facebook  3000
3   Youtube  4000

In [24]:
# Pandas Attributes
# shape
# size
# index
# columns
dfd.shape

(4, 4)

In [25]:
dfd.size

16

In [26]:
dfd.index

RangeIndex(start=0, stop=4, step=1)

In [27]:
dfd.columns

Index(['Name', 'Rev', 'Cnt', 'Intr'], dtype='object')

In [28]:
# Data Type
print(type(dfd))

<class 'pandas.core.frame.DataFrame'>

In [29]:
print(type(dfd.Name))

<class 'pandas.core.series.Series'>

In [30]:
print(type(dfd[['Name','Rev']]))

<class 'pandas.core.frame.DataFrame'>

In [32]:
df1=pd.DataFrame(data=[10,20,30,40],columns=['A'],index=['Ten','Twenty','Thirty','Forty'])

In [33]:
df1

         A
Ten     10
Twenty  20
Thirty  30
Forty   40

In [34]:
df2=pd.DataFrame([10,20,30,40])

In [35]:
df2

    0
0  10
1  20
2  30
3  40

In [37]:
df2.columns=['A']

In [38]:
df2

    A
0  10
1  20
2  30
3  40

In [39]:
df2.index=['S','T','U','V']

In [40]:
df2

    A
S  10
T  20
U  30
V  40

In [48]:
df2['A']['S'] # columns and ros

10

In [49]:
df1

         A
Ten     10
Twenty  20
Thirty  30
Forty   40

In [61]:
df3=pd.DataFrame([[50,60,70,90],['A','B','C','D'],[10,20,40,50],['E','F','G','H']])

In [62]:
df3

    0   1   2   3
0  50  60  70  90
1   A   B   C   D
2  10  20  40  50
3   E   F   G   H

In [53]:
df3[:][0:2]

    0
0  50
1  60

In [54]:
df3[:][2:5]

     0
2   70
3   90
4  100

In [65]:
df3[2:5]

    0   1   2   3
2  10  20  40  50
3   E   F   G   H

In [72]:
df3[[0,1,2]][0:2]

    0   1   2
0  50  60  70
1   A   B   C

In [73]:
df3[0:2][[0,1,2]] # Remarks

    0   1   2
0  50  60  70
1   A   B   C

In [74]:
# iloc and loc -> fetch the data by axis (axis=0 by rows) (axis=1 by column)
# iloc - always integer index
# loc - always string index

In [75]:
dfd

       Name   Rev      Cnt  Intr
0    Google  1000    India   200
1     Yahoo  2000      USA   300
2  Facebook  3000   France   400
3   Youtube  4000  Germany   500

In [87]:
dfd.iloc[0]

Name    Google
Rev       1000
Cnt      India
Intr       200
Name: 0, dtype: object

In [91]:
dfd.iloc[[0,1,2]]

       Name   Rev     Cnt  Intr
0    Google  1000   India   200
1     Yahoo  2000     USA   300
2  Facebook  3000  France   400

In [97]:
dfd.iloc[2][['Cnt','Intr']]

Cnt     France
Intr       400
Name: 2, dtype: object

In [98]:
df2

    A
S  10
T  20
U  30
V  40

In [99]:
df2.loc['S']

A    10
Name: S, dtype: int64

In [100]:
df2.iloc['S']

TypeError: Cannot index by location index with a non-integer key

In [108]:
df4= pd.DataFrame([[0, 2, 3], [0, 4, 1], [10, 20, 30]],
                   columns=['A', 'B', 'C'])

In [109]:
df4

    A   B   C
0   0   2   3
1   0   4   1
2  10  20  30

In [110]:
df4.iat[1,2] # Access a single value for a row/column pair by integer position.

1

In [115]:
df4.iat[2,1]

20

In [116]:
df4

    A   B   C
0   0   2   3
1   0   4   1
2  10  20  30

In [117]:
df4.ix[0]

E:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

A    0
B    2
C    3
Name: 0, dtype: int64

In [119]:
df2.ix['S']

E:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

A    10
Name: S, dtype: int64

In [120]:
df

     0
0  100
1  200
2  300
3  400

In [123]:
df4.iloc[0:].values

array([[ 0,  2,  3],
       [ 0,  4,  1],
       [10, 20, 30]], dtype=int64)

In [124]:
df4

    A   B   C
0   0   2   3
1   0   4   1
2  10  20  30

In [125]:
df4

    A   B   C
0   0   2   3
1   0   4   1
2  10  20  30